# -*- encoding: utf-8 -*-
'''
@File : 03.py
@Time : 2020/03/08 00:57:36
@Author : xdbcb8 
@Version : 1.0
@Contact : xdbcb8@qq.com
@WebSite : www.xdbcb8.com
'''

# here put the import lib
#!/usr/bin/python3

# 8 设计一个数据结构，用来存放10个员工的信息并初始化，
# 每个员工信息包括：工号，姓名，工龄，工资
# 将这10个员工，按照工资从高到低打印输出
# 提示：可以组合使用我们的序列数据类型

list0=[
    (100,"张三",3,4500),
    (101,"李四",2,3500),
    (102,"李四",2,3500),
    (103,"王五",4,5000),
    (104,"赵达",5,5500),
    (105,"陈选",2,3500),
    (106,"夏侯",1,3000),
    (107,"李想",2,3500),
    (108,"赵项",3,4500),
    (103,"章新",4,5000)
]

list0.sort(key=lambda x:x[3],reverse=True)
print(list0)